import { CategoryType } from '../model/mineral.type';

export const CategoriesData: CategoryType[] = [
  {
    id: 0,
    name: 'Минералы',
    description:
      'Однородная по составу и строению часть горных пород, руд, метеоритов, являющаяся естественным продуктом геологических процессов и представляющая собой химическое соединение или химический элемент. \nМинерал может находиться в любом агрегатном состоянии, при этом большинство минералов — твёрдые тела. Минералы подразделяют на имеющие кристаллическую структуру, аморфные и минералы, имеющие внешнюю форму кристаллов, но находящиеся в аморфном состоянии (метамиктные минералы).',
  },
  {
    id: 1,
    name: 'Ромбическая сингония',
    description:
      'Одна из семи кристаллических систем, характеризующаяся тремя неравными по длине осями (a, b, c), перпендикулярными друг другу. Кристаллы этой системы имеют призматический или бипирамидальный вид.',
  },
  {
    id: 2,
    name: 'Кубическая сингония',
    description:
      'Одна из семи кристаллических систем, характеризующаяся наивысшей симметрией. Кристаллы этой системы имеют кубическую форму, обусловленную равными по длине и перпендикулярными друг другу ребрами элементарной ячейки.',
  },
  {
    id: 3,
    name: 'Ортоомбическая сингония',
    description:
      'Одна из семи кристаллических систем, характеризующаяся тремя неравными по длине осями (a, b, c), перпендикулярными друг другу. Кристаллы этой системы имеют призматический или бипирамидальный вид и хорошо развитую спайность по всем трем направлениям.',
  },
  {
    id: 4,
    name: 'Тригональная сингония',
    description:
      'одна из семи кристаллических систем, отличающаяся тремя неравными осями и одной осью симметрии 3-го порядка. Кристаллы этой сингонии имеют ромбоэдрический, призматический или бипирамидальный вид.',
  },
  {
    id: 5,
    name: 'Осадочные породы',
    description:
      'Горные породы, существующие в термодинамических условиях, характерных для поверхностной части земной коры, и образующиеся в результате переотложения продуктов выветривания и разрушения различных горных пород, химического и механического выпадения осадка из воды, жизнедеятельности организмов или всех трёх процессов одновременно. \nТакже верхний слой в земной коре. Большинство осадочных пород залегает в виде пластов, или слоёв. \nИзучением осадочных горных пород занимается наука литология.',
  },
  {
    id: 6,
    name: 'Тетрагональная сингония',
    description: 'Описание для категории 3',
  },
  {
    id: 7,
    name: 'Моноклинная сингония',
    description:
      'Одна из семи основных кристаллических систем, характеризующаяся одним кристаллографическим направлением, отличным от остальных двух. Это означает, что кристаллы моноклинной системы имеют одну ось симметрии, а их грани могут быть приложены к двум плоскостям симметрии.',
  },
  {
    id: 8,
    name: 'Магматические породы',
    description:
      'Конечные продукты магматической деятельности, возникшие в результате затвердевания природного расплава (магмы, лавы). Переход расплава в твёрдое состояние сопровождается кристаллизацией вещества. \nВстречаются в широком диапазоне геологических условий: щиты, платформы, орогены, океаническая кора и др. Магматические и метаморфические породы по объёму составляют 90—95 % верхней (16 км) земной коры. \nМагматические породы образуют около 15 % современной поверхности Земли.',
  },
  {
    id: 9,
    name: 'Вулканические породы',
    description:
      'Магматические горные породы, образовавшиеся в результате застывания на земной поверхности или вблизи неё лавы, излившейся по вулканическим каналам или трещинам в земной коре. \nОбычно характеризуются сочетанием вулканического стекла, мелких кристаллов (микролитов) и более крупных порфировых выделений (вкрапленников).',
  },
  {
    id: 10,
    name: 'Метаморфические породы',
    description:
      'Горные породы, образованные в толще земной коры в результате метаморфизма, то есть изменения осадочных и магматических горных пород вследствие изменения физико-химических условий. \nБлагодаря движениям земной коры, осадочные горные породы и магматические горные породы подвергаются воздействию высокой температуры, большого давления и различных газовых и водных растворов, при этом они начинают изменяться.',
  },
  {
    id: 11,
    name: 'Хлориды',
    description:
      'Химические соединения хлора с менее электроотрицательными элементами, в которых он проявляет степень окисления –1',
  },
  {
    id: 12,
    name: 'Слюды',
    description:
      'Группа минералов-алюмосиликатов, обладающих слоистой структурой. Слюда — один из наиболее распространённых породообразующих минералов интрузивных, метаморфических и осадочных горных пород, а также важное полезное ископаемое.',
  },
  {
    id: 13,
    name: 'Породообразующие минералы',
    description:
      'Минералы, входящие в качестве постоянных существенных компонентов в состав горных пород.',
  },
  {
    id: 15,
    name: 'Осадочные минералы',
    description:
      'Минералы, которые образуются в результате процессов выветривания, эрозии и осаждения.\nОсадочные минералы можно разделить на две категории: обломочные и химические. Обломочные минералы - это те, которые образуются, когда более крупные куски породы разрушаются и переносятся в новое место. Химические минералы - это те, которые образуются из растворов, таких как морская вода.',
  },
  {
    id: 14,
    name: 'Силикаты',
    description:
      'Обширная группа минералов, являющихся основой земной коры. Они образованы кремнекислородными тетраэдрами, соединенными между собой различными способами, что приводит к образованию разных структур и свойств.',
  },
  {
    id: 16,
    name: 'Сульфиды',
    description:
      'Природные сернистые соединения металлов и некоторых неметаллов. Широко распространены в природе, составляя около 0,15 % от массы земной коры. \nПроисхождение преимущественно гидротермальное, некоторые сульфиды образуются и при экзогенных процессах в условиях восстановительной среды. Являются рудами многих металлов — Cu, Ag, Hg (HgS), Zn, Pb, Sb, Co, Ni и др.',
  },
  {
    id: 17,
    name: 'Триклинная сингония',
    description:
      'Одна из семи сингоний в кристаллографии. Её элементарная ячейка определяется тремя базовыми векторами (трансляциями) разной длины, все углы между которыми не являются прямыми. Таким образом, форма ячейки определяется шестью параметрами: длинами базовых векторов a, b и c и углами между ними α, β и γ.',
  },
  {
    id: 18,
    name: 'Гранаты',
    description:
      'Обширная группа близких по строению и свойствам минералов надгруппы граната (структурный тип граната), относящихся к классу силикатов с изолированными тетраэдрами.\nСчитается, что слово «гранаты» впервые появилось в обиходе благодаря средневековому алхимику Альберту Магнусу, а то, что этот термин  теперь признан повсеместно,  является безусловной заслугой немецкого геолога Вернера.',
  },
  {
    id: 19,
    name: 'Интрузивные породы',
    description:
      'Полнокристаллические магматические горные породы, сформировавшиеся в результате застывания магмы, внедрившейся в толщи земной коры и мантии, в отличие от эффузивных горных пород, представляющих собой магму, излившуюся и затвердевшую на поверхности Земли в форме вулканической лавы. \nИнтрузивные горные породы образуют геологические тела разнообразных форм и размеров. Границы этих тел (интрузий) чаще всего являются резко секущими относительно вмещающих толщ, однако встречаются и сонаправленные, такие как силлы. Вокруг интрузий за счёт разницы в температурах магмы и окружающих толщ появляются контактовые ореолы изменённых пород.',
  },
  {
    id: 20,
    name: 'Экструзивные породы',
    description:
      'Экструзивные породы, возникшие в результате трещинных излияний, собственно излившиеся, или эффузивные и экструзивные породы, образовавшиеся при извержениях эксплозионного типа, составляют группу экструзивных пород.\nДля большинства экструзивных пород характерны пористые, флюидные, полосчатые и миндалекаменные текстуры и неполно-кристаллические - стекловатые и микрокристаллические (микролитовые, сферолитовые и т.д.) структуры. Часто встречаются разности пород порфировой структуры, которая обусловлена наличием крупных кристаллов (вкрапленников) в основной (микро-литовой) массе. Количество вкрапленников может изменяться в широких пределах (от единичных зерен до 50% от объема породы).',
  },
  {
    id: 21,
    name: 'Обломочные породы',
    description:
      'Осадочные породы экзогенного происхождения, которые в основном содержат обломки других горных пород или минералов. \nОбломки образуются как результат процессов выветривания, вулканизма, тектонической и техногенной активности. Сортировка и скругление обломков связаны с их переносом под воздействием потоков воды, ветра и движения льда.',
  },
];
