import { CategoryType } from '../model/mineral.type';

export const CategoriesData: CategoryType[] = [
  {
    id: 0,
    name: 'Минералы',
    description:
      'Однородная по составу и строению часть горных пород, руд, метеоритов, являющаяся естественным продуктом геологических процессов и представляющая собой химическое соединение или химический элемент. \nМинерал может находиться в любом агрегатном состоянии, при этом большинство минералов — твёрдые тела. Минералы подразделяют на имеющие кристаллическую структуру, аморфные и минералы, имеющие внешнюю форму кристаллов, но находящиеся в аморфном состоянии (метамиктные минералы).',
  },
  {
    id: 1,
    name: 'Ромбическая сингония',
    description:
      'Одна из семи кристаллических систем, характеризующаяся тремя неравными по длине осями (a, b, c), перпендикулярными друг другу. Кристаллы этой системы имеют призматический или бипирамидальный вид.',
  },
  {
    id: 2,
    name: 'Кубическая сингония',
    description:
      'Одна из семи кристаллических систем, характеризующаяся наивысшей симметрией. Кристаллы этой системы имеют кубическую форму, обусловленную равными по длине и перпендикулярными друг другу ребрами элементарной ячейки.',
  },
  {
    id: 3,
    name: 'Ортоомбическая сингония',
    description:
      'Одна из семи кристаллических систем, характеризующаяся тремя неравными по длине осями (a, b, c), перпендикулярными друг другу. Кристаллы этой системы имеют призматический или бипирамидальный вид и хорошо развитую спайность по всем трем направлениям.',
  },
  {
    id: 4,
    name: 'Тригональная сингония',
    description:
      'одна из семи кристаллических систем, отличающаяся тремя неравными осями и одной осью симметрии 3-го порядка. Кристаллы этой сингонии имеют ромбоэдрический, призматический или бипирамидальный вид.',
  },
  {
    id: 5,
    name: 'Осадочные породы',
    description:
      'Горные породы, существующие в термодинамических условиях, характерных для поверхностной части земной коры, и образующиеся в результате переотложения продуктов выветривания и разрушения различных горных пород, химического и механического выпадения осадка из воды, жизнедеятельности организмов или всех трёх процессов одновременно. \nТакже верхний слой в земной коре. Большинство осадочных пород залегает в виде пластов, или слоёв. \nИзучением осадочных горных пород занимается наука литология.',
  },
  {
    id: 6,
    name: 'Тетрагональная сингония',
    description: 'Описание для категории 3',
  },
  {
    id: 7,
    name: 'Моноклинная сингония',
    description:
      'Одна из семи основных кристаллических систем, характеризующаяся одним кристаллографическим направлением, отличным от остальных двух. Это означает, что кристаллы моноклинной системы имеют одну ось симметрии, а их грани могут быть приложены к двум плоскостям симметрии.',
  },
  {
    id: 8,
    name: 'Магматические породы',
    description:
      'Конечные продукты магматической деятельности, возникшие в результате затвердевания природного расплава (магмы, лавы). Переход расплава в твёрдое состояние сопровождается кристаллизацией вещества. \nВстречаются в широком диапазоне геологических условий: щиты, платформы, орогены, океаническая кора и др. Магматические и метаморфические породы по объёму составляют 90—95 % верхней (16 км) земной коры. \nМагматические породы образуют около 15 % современной поверхности Земли.',
  },
  {
    id: 9,
    name: 'Вулканические породы',
    description:
      'Магматические горные породы, образовавшиеся в результате застывания на земной поверхности или вблизи неё лавы, излившейся по вулканическим каналам или трещинам в земной коре. \nОбычно характеризуются сочетанием вулканического стекла, мелких кристаллов (микролитов) и более крупных порфировых выделений (вкрапленников).',
  },
  {
    id: 10,
    name: 'Метаморфические породы',
    description:
      'Горные породы, образованные в толще земной коры в результате метаморфизма, то есть изменения осадочных и магматических горных пород вследствие изменения физико-химических условий. \nБлагодаря движениям земной коры, осадочные горные породы и магматические горные породы подвергаются воздействию высокой температуры, большого давления и различных газовых и водных растворов, при этом они начинают изменяться.',
  },
  {
    id: 11,
    name: 'Хлориды',
    description:
      'Химические соединения хлора с менее электроотрицательными элементами, в которых он проявляет степень окисления –1',
  },
  {
    id: 12,
    name: 'Слюды',
    description:
      'Группа минералов-алюмосиликатов, обладающих слоистой структурой. Слюда — один из наиболее распространённых породообразующих минералов интрузивных, метаморфических и осадочных горных пород, а также важное полезное ископаемое.',
  },
  {
    id: 13,
    name: 'Породообразующие минералы',
    description:
      'Минералы, входящие в качестве постоянных существенных компонентов в состав горных пород.',
  },
  {
    id: 15,
    name: 'Осадочные минералы',
    description:
      'Минералы, которые образуются в результате процессов выветривания, эрозии и осаждения.\nОсадочные минералы можно разделить на две категории: обломочные и химические. Обломочные минералы - это те, которые образуются, когда более крупные куски породы разрушаются и переносятся в новое место. Химические минералы - это те, которые образуются из растворов, таких как морская вода.',
  },
  {
    id: 14,
    name: 'Силикаты',
    description:
      'Обширная группа минералов, являющихся основой земной коры. Они образованы кремнекислородными тетраэдрами, соединенными между собой различными способами, что приводит к образованию разных структур и свойств.',
  },
];
